Criando os nomes

In [27]:
import pandas as pd
import numpy as np

Import de dados do IBGE

In [21]:
nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/?qtd=200&sexo=m')
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/?qtd=200&sexo=f')

In [22]:
nomes_m.head(3)

      nome  regiao     freq  rank sexo
0     JOSE       0  5732508     1    M
1     JOAO       0  2971935     2    M
2  ANTONIO       0  2567494     3    M

In [23]:
nomes_f.head(3)

        nome  regiao      freq  rank sexo
0      MARIA       0  11694738     1    F
1        ANA       0   3079729     2    F
2  FRANCISCA       0    721637     3    F

In [24]:
print("Quantidade de nomes: " + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes: 400

In [25]:
frames = [nomes_m, nomes_f]
nomes = pd.concat(frames).nome.to_frame()
nomes.sample(5) #pega dados aleatorios do df

       nome
108   VILMA
47    JULIO
11   CAMILA
165  EUNICE
186    INES

Incluindo IDs

In [30]:
np.random.seed(123)

In [31]:
nomes['id_aluno'] = np.random.permutation(len(nomes)) + 1
nomes

          nome  id_aluno
0         JOSE       235
1         JOAO        43
2      ANTONIO       304
3    FRANCISCO       156
4       CARLOS       343
..         ...       ...
195     ROSANE       231
196    IVONETE        99
197    LUCIANE       323
198    ISADORA       383
199      NILZA       366

[400 rows x 2 columns]

Dominios de email

In [33]:
total_alunos = len(nomes)
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)
nomes

          nome  id_aluno                 dominio
0         JOSE       235  @dominiodoemail.com.br
1         JOAO        43     @servicodoemail.com
2      ANTONIO       304  @dominiodoemail.com.br
3    FRANCISCO       156     @servicodoemail.com
4       CARLOS       343     @servicodoemail.com
..         ...       ...                     ...
195     ROSANE       231     @servicodoemail.com
196    IVONETE        99  @dominiodoemail.com.br
197    LUCIANE       323  @dominiodoemail.com.br
198    ISADORA       383  @dominiodoemail.com.br
199      NILZA       366     @servicodoemail.com

[400 rows x 3 columns]

Concatenando nome com o email

In [34]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()
nomes

,nome,id_aluno,dominio,email
0,JOSE,235,@dominiodoemail.com.br,jose@dominiodoemail.com.br
1,JOAO,43,@servicodoemail.com,joao@servicodoemail.com
2,ANTONIO,304,@dominiodoemail.com.br,antonio@dominiodoemail.com.br
3,FRANCISCO,156,@servicodoemail.com,francisco@servicodoemail.com
4,CARLOS,343,@servicodoemail.com,carlos@servicodoemail.com
...,...,...,...,...
195,ROSANE,231,@servicodoemail.com,rosane@servicodoemail.com
196,IVONETE,99,@dominiodoemail.com.br,ivonete@dominiodoemail.com.br
197,LUCIANE,323,@dominiodoemail.com.br,luciane@dominiodoemail.com.br
198,ISADORA,383,@dominiodoemail.com.br,isadora@dominiodoemail.com.br
199,NILZA,366,@servicodoemail.com,nilza@servicodoemail.com